cask_args appdir: '~/Applications'

brew 'vim', args: ['with-lua', 'with-python3', 'with-python']
brew 'macvim', args: ['with-lua', 'with-python3', 'with-python']
brew 'clisp'
brew 'git'
brew 'tig'
brew 'tmux'
brew 'heroku'
brew 'ansible'
brew 'docker'
brew 'ag'
brew 'peco'
brew 'mas'
brew 'mercurial'
brew 'sdl'
brew 'khell/homebrew-srm/srm'
brew 'ctags'
brew 'maven'
brew 'doxygen'
brew 'graphviz'
brew 'mongodb'
brew 'brew-cask'
brew 'redis'
brew 'reattach-to-user-namespace'
brew 'roswell'
brew 'jq'

cask 'ccleaner'
cask 'iterm2'
cask 'vagrant'
cask 'virtualbox'
cask 'karabiner'
cask 'google-chrome'
cask 'spectacle'
cask 'filezilla'

mas '1Password (6.7)', id: 443987910
mas 'XCode (8.0)', id: 497799835
