cask_args appdir: '~/Applications'

brew 'vim', args: ['with-lua', 'with-python3', 'with-python']
brew 'macvim', args: ['with-lua', 'with-python3', 'with-python']
brew 'clisp'
brew 'git'
brew 'tig'
brew 'tmux'
brew 'heroku'
brew 'mas'

cask 'ccleaner'
cask 'iterm2'
cask 'vagrant'
cask 'virtualbox'
cask 'karabiner'
cask 'java'

mas '1Password', id: 443987910
mas 'XCode', id: 497799835
